app/controllers/movies_controller.rb

    def index
      @movies = Movie.all
      @all_ratings = Movie.all_ratings
      @rating_param = rate
      @sorting_on_column = params[:sort]

      if @sorting_on_column
        @movies = Movie.with_ratings(@rating_param).order(@sorting_on_column)
---
SELECT "movies".* FROM "movies" WHERE (rating IN ('R'))  ORDER BY release_date
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13')  ORDER BY "movies"."sort" ASC